
#Область Серверный_интерфейс

&НаСервере
// Обработчик события ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Сбрасываем сохраненные настройки размеров и положения окна.
	КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
	Объект.ВыполнятьВРежимеЗагрузки		  = Параметры.ВыполнятьВРежимеЗагрузки;
	Объект.ВыполнятьВТранзакции			  = Параметры.ВыполнятьВТранзакции;
  	Объект.НеПрерыватьВыполнениеПриОшибке = Параметры.НеПрерыватьВыполнениеПриОшибке;
	
	Элементы.ПрерыватьВыполнениеПриОшибке.Видимость = НЕ Объект.ВыполнятьВТранзакции;
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_команд

&НаКлиенте
// Обработчик команды СохранитьИЗакрыть.
//
Процедура СохранитьИЗакрыть(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("ВыполнятьВТранзакции",			 Объект.ВыполнятьВТранзакции); 
	Структура.Вставить("ВыполнятьВРежимеЗагрузки",		 Объект.ВыполнятьВРежимеЗагрузки);
	Структура.Вставить("НеПрерыватьВыполнениеПриОшибке", Объект.НеПрерыватьВыполнениеПриОшибке);
	
	ЭтаФорма.Закрыть(Структура);
	
КонецПроцедуры

&НаКлиенте
// Обработчик события ПриИзменении флажка ВыполнятьВТранзакции.
//
Процедура ВыполнятьВТранзакцииПриИзменении(Элемент)
	
	Элементы.ПрерыватьВыполнениеПриОшибке.Видимость = НЕ Объект.ВыполнятьВТранзакции;
	
КонецПроцедуры

#КонецОбласти
