
#Область Серверный_интерфейс

&НаСервере
// Обработчик события ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Сбрасываем сохраненные настройки размеров и положения окна.
	КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
	Если Параметры.ТаблицаКолонок.Количество() > 0 Тогда
		
		Для Каждого Колонка Из Параметры.ТаблицаКолонок Цикл
			ТаблицаКолонок.Добавить(Колонка.Значение, Колонка.Представление, Колонка.Пометка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_команд

&НаКлиенте
// Обработчик команды ВыбратьИЗакрыть.
//
Процедура ВыбратьИЗакрыть(Команда)
	
	ЭтаФорма.Закрыть(ТаблицаКолонок);
	
КонецПроцедуры

&НаКлиенте
// Обработчик команды УстановитьФлажки.
//
Процедура УстановитьФлажки(Команда)
	
	УстановитьСнятьФлажки(Истина);
	
КонецПроцедуры

&НаКлиенте
// Обработчик команды СнятьФлажки.
//
Процедура СнятьФлажки(Команда)
	
	УстановитьСнятьФлажки(Ложь);
	
КонецПроцедуры

&НаКлиенте
// Устанавливает/снимает флажки в таблице.
//
Процедура УстановитьСнятьФлажки(Значение)
	
	Для Каждого ЭлементСписка Из ТаблицаКолонок Цикл
		ЭлементСписка.Пометка = Значение;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
